#pragma once

#include <cstdint>

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x5c0
// Has VTable
// 
// MNetworkVarNames "bool m_bIsPlayingBack"
// MNetworkVarNames "bool m_bPaused"
// MNetworkVarNames "bool m_bMultiplayer"
// MNetworkVarNames "bool m_bAutogenerated"
// MNetworkVarNames "float32 m_flForceClientTime"
// MNetworkVarNames "uint16 m_nSceneStringIndex"
// MNetworkVarNames "CHandle< C_BaseFlex > m_hActorList"
class C_SceneEntity : public C_PointEntity
{
private:
	[[maybe_unused]] uint8_t __pad0560[0x8]; // 0x560
public:
	// MNetworkEnable
	bool m_bIsPlayingBack; // 0x568	
	// MNetworkEnable
	bool m_bPaused; // 0x569	
	// MNetworkEnable
	bool m_bMultiplayer; // 0x56a	
	// MNetworkEnable
	bool m_bAutogenerated; // 0x56b	
	// MNetworkEnable
	// MNetworkChangeCallback "OnResetClientTime"
	float m_flForceClientTime; // 0x56c	
	// MNetworkEnable
	// MNetworkPriority "32"
	uint16_t m_nSceneStringIndex; // 0x570	
	bool m_bClientOnly; // 0x572	
private:
	[[maybe_unused]] uint8_t __pad0573[0x1]; // 0x573
public:
	CHandle< C_BaseFlex > m_hOwner; // 0x574	
	// MNetworkEnable
	// MNetworkPriority "32"
	C_NetworkUtlVectorBase< CHandle< C_BaseFlex > > m_hActorList; // 0x578	
	bool m_bWasPlaying; // 0x590	
private:
	[[maybe_unused]] uint8_t __pad0591[0xf]; // 0x591
public:
	CUtlVector< C_SceneEntity::QueuedEvents_t > m_QueuedEvents; // 0x5a0	
	float m_flCurrentTime; // 0x5b8	
};

