#pragma once

#include <cstdint>

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x588
// Has VTable
class CMapInfo : public C_PointEntity
{
public:
	int32_t m_iBuyingStatus; // 0x568	
	float m_flBombRadius; // 0x56c	
	int32_t m_iPetPopulation; // 0x570	
	bool m_bUseNormalSpawnsForDM; // 0x574	
	bool m_bDisableAutoGeneratedDMSpawns; // 0x575	
private:
	[[maybe_unused]] uint8_t __pad0576[0x2]; // 0x576
public:
	float m_flBotMaxVisionDistance; // 0x578	
	int32_t m_iHostageCount; // 0x57c	
	bool m_bFadePlayerVisibilityFarZ; // 0x580	
	bool m_bRainTraceToSkyEnabled; // 0x581	
	
	// Datamap fields:
	// int32_t InputFireWinCondition; // 0x0
};

