#pragma once

#include <cstdint>

// Registered binary: server.dll (project 'server')
// Alignment: 4
// Size: 0x2c
// Has Trivial Destructor
// 
// MGetKV3ClassDefaults
struct ObjectivesParams_t
{
public:
	int32_t m_GoldPerOrb; // 0x0	
	int32_t m_nTier1GoldKill; // 0x4	
	int32_t m_nTier1GoldOrbs; // 0x8	
	int32_t m_nTier2GoldKill; // 0xc	
	int32_t m_nTier2GoldOrbs; // 0x10	
	int32_t m_nBaseGuardiansGoldKill; // 0x14	
	int32_t m_nBaseGuardiansGoldOrbs; // 0x18	
	int32_t m_nShrinesGoldKill; // 0x1c	
	int32_t m_nShrinesGoldOrbs; // 0x20	
	int32_t m_nPatronPhase1GoldKill; // 0x24	
	int32_t m_nPatronPhase1GoldOrbs; // 0x28	
};

